Repository: markcollis/mapoholic-client
Catalog: src/locales/*/messages.po
Languages: cs

source: (to match QuickRoute output)
cs: (odpovídající výstupu QuickRoute)

source: * Since you are reading the English version of the site, you may not know what ORIS is. It is the Czech Orienteering Federation portal that provides a common database for events, including handling entries, publishing results and producing rankings. All significant events in the Czech Republic are included, as are many smaller local ones. As an added bonus, there is a public API which exposes this data so that MapOholic can import and exploit it.
cs: Vzhledem k tomu, že čteš anglickou verzi stránek, tak možná nevíš co je ORIS. Je to informační portál Českého svazu orientačních sportů, který funguje jako databáze závodů, mezi jehož funkce patří přihlášky na závody, publikace výsledků a vytváření soutěžních žebříčků. Jako přidaný bonus obsahuje ORIS veřejný API (application programming interface), který umožňuje přístup k těmto datům, takže MapOholic je může importovat a využívat.

source: <0>* QuickRoute is an excellent tool for processing GPS tracks. The JPG images of routes exported from it include track data and MapOholic can use this to determine the location of a map without needing to enter it manually. When you don't have a GPS track available, any graphics editor can be used to draw a route on a scanned map.</0>
cs: QuickRoute je výborný nástroj ke zpracovávání GPS stop. Obrázky tratí ve formátu JPG, které QuickRoute exportuje, obsahují informaci o stopě a MapOholic ji může využít k určení polohy mapy, aniž by ji člověk musel zadávat ručně. Pokud GPS stopu nemáte, stačí využít jakýkoliv grafický editor k nakreslení postupů do naskenované mapy.

source: > List
cs: > Seznam

source: > Map
cs: > Mapa

source: A brief user profile
cs: Krátký profil uživatele

source: A comment about {0}'s run at {1} was deleted by {2}
cs: Komentář k běhu {0} na {1} byla smazána uživatelem {2}

source: A comment about {0}'s run at {1} was updated by {2}
cs: Komentář k běhu {0} na {1} byla upravena uživatelem {2}

source: A new comment was posted about {0}'s run at {1} by {2}
cs: Nový komentář k {0} běhu {0} na {1} byla poslána uživatelem {2}

source: A new link between events {0} was created by {1}
cs: Nový odkaz mezi závody {0} byl vytvořen uživatelem {1}

source: Abbreviation
cs: Zkratka

source: About
cs: O

source: About me
cs: O mně

source: Add Results
cs: Přidat výsledky

source: Add a comment
cs: Přidat komentář

source: Add a new link
cs: Přidat nový odkaz

source: Add border
cs: Přidat ohraničení

source: Add club
cs: Přidat oddíl

source: Add event
cs: Přidat závod

source: Add new event link
cs: Přidat nový odkaz na závod

source: Add or Delete maps
cs: Přidat nebo Smazat mapy

source: Add or change maps
cs: Přidat nebo změnit mapy

source: Add or change user profile image
cs: Přidat nebo změnit obrázek uživatele

source: Add title
cs: Přidat název

source: Add yourself as a runner
cs: Přidat sebe jako běžce

source: Additional information for administrators
cs: Další informace pro Správce

source: Address of club website
cs: Webová stránka oddílu

source: Address of event website
cs: Webová stránka závodu

source: All recent activity
cs: Všechny nedávné změny

source: Are you sure you want to delete "{displayName}"?
cs: Opravdu chceš smazat "{displayName}"?

source: As a guest user, you are able to browse or search for maps {eventsListLink} or {eventsMapLink}, but can not upload or comment on them. If you would like to add some maps of your own, please {signUpLink} for an individual account.
cs: Jako uživatel ‘host’ si můžeš mapy prohlížet a vyhledávat je, ale nemůžeš žádné nahrávat ani přidávat komentáře. Pokud chceš přidávat vlastní mapy, prosím zaregistruj se ({signUpLink}) a vytvoř si vlastní uživatelský účet.

source: As this event has an ORIS ID, <0>results in JSON format</0>may be available and can be imported by downloading the file from ORIS and then uploading it here.
cs: Tento závod má ORIS ID, je tedy možné, že <0>výsledky ve formátu JSON format</0> jsou dostupné a mohou být staženy z ORISu a následně nahrány sem

source: Behind
cs: Časová ztráta

source: But there is much more to it than that. The maps can be linked to detailed information about the event and your performance, and you can quickly see how other users did at the same race. For Czech events registered on ORIS, event details, course details and results can be added automatically. You can also tag your maps in any way you like and add comments to both your own and other users' maps. The search filter matches event and map names, dates, places and the different types of tags so that your maps are easy to find.
cs: Ale je tu toho ještě mnohem víc. Mapy můžou být propojeny s podrobnými detaily o závodě a o tvém výkonu a rychle zjistíš jak na stejném závodě beželi ostatní uživatelé. U českých závodů registrovaných na ORISu je možné informace o závodě, o tratích a výsledcích mohou stáhnout automaticky. Můžeš libovolně označovat své mapy a přidávat komentáře ke svým mapám i k mapám ostatních uživatelů. Vyhledávat můžeš podle jména závodu nebo mapy, podle data závodu, podle lokality i podle dalších označení a tudíž jsou mapy jednoduše dohledatelné

source: Cancel
cs: Zrušit

source: Change Password
cs: Změnit Heslo

source: Change password
cs: Změnit heslo

source: Change title
cs: Změnit název

source: Climb on course (m)
cs: Převýšení na trati (m)

source: Club
cs: Oddíl

source: Club details
cs: Detaily oddílu

source: Club list
cs: Seznam oddílů

source: Club search filter
cs: Filtr vyhledávání oddílů

source: Clubs
cs: Oddíly

source: Clubs that event is organised by
cs: Pořádající oddíly

source: Clubs that user is a member of
cs: Oddíly, kde je uživatel členem

source: Comments
cs: Komentáře

source: Confirm change
cs: Potvrdit změnu

source: Country
cs: Země

source: Country in which club is based
cs: Země ve které je oddíl

source: Course
cs: Trať

source: Course climb
cs: Převýšení tratě

source: Course length
cs: Délka tratě

source: Course title
cs: Název tratě

source: Course: <0>{courseTitle}</0>
cs: Trať: <0>{courseTitle}</0>

source: Create
cs: Vytvořit

source: Create Event
cs: Vytvořit Závod

source: Create event using ORIS data
cs: Vytvořit závod (data z ORISu)

source: Created: {0}
cs: Vytvořený: {0}

source: Current Map
cs: Aktuální Mapa

source: Current password
cs: Aktuální heslo

source: Date
cs: Datum

source: Dedicated to those that know you can never have too many {linkOMaps}
cs: Pro ty, kteří ví, že nikdy nemohou mít příliš mnoho {linkOMaps}

source: Delete
cs: Smazat

source: Delete Club
cs: Smazat Oddíl

source: Delete Event: {name} ({date})
cs: Smazat Závod: {name} ({date})

source: Delete Event?
cs: Smazat Závod?

source: Delete Runner
cs: Smazat Běžce

source: Delete User
cs: Smazat Uživatele

source: Delete club
cs: Smazat oddíl

source: Delete comment
cs: Smazat komentář

source: Delete current
cs: Smazat aktuální

source: Delete event
cs: Smazat závod

source: Delete event link
cs: Smazat odkaz na závod

source: Delete link
cs: Smazat odkaz

source: Delete runner
cs: Smazat běžce

source: Delete user
cs: Smazat uživatele

source: Delete {displayName}?
cs: Smazat {displayName}?

source: Delete {runnerName}?
cs: Smazat {runnerName}?

source: Delete {shortName}?
cs: Smazat {shortName}?

source: Deleting a user removes their details and all of their event records including maps. All that is retained is any comments that they have made on other users' maps.
cs: Vymazání uživatele odstraní jeho data i všechny informace o jeho závodech, včetně jeho map. Jediné co zůstane jsou komentáře uživatele na mapách ostatních uživatelů.

source: Do you have a large collection of orienteering maps neatly filed away? Can you never bear to throw away a map? Do you wish it was easier to search your collection? Do you have easy access to your route choices and results for each event? Are you interested in seeing your friends' maps and routes as well?
cs: Máš obrovskou sbírku pečlivě uschovaných map? Nemůžeš se primět k tomu je vyhodit? Chtěl bys ve sbírce jednodušeji vyhledávat? Máš jednoduchý přístup ke svým postupům a výsledkům z každého závodu? Viděl bys rád i mapy a postupy svých známých?

source: Download current results: {downloadCSV} {downloadJSON}
cs: Stáhnout aktuální výsledky

source: Download results template: {downloadCSV} {downloadJSON}
cs: Stáhnout výsledkovou šablonu

source: Duplicate map title
cs: Duplikuj název mapy

source: Edit
cs: Upravit

source: Edit Event Details
cs: Upravit Detaily Závodu

source: Edit Event Runner Details
cs: Upravit Detaily Běžce

source: Edit Results
cs: Upravit výsledky

source: Edit User Details
cs: Upravit Detaily Uživatele

source: Edit club details
cs: Upravit detaily oddílu

source: Edit event details
cs: Upravit detaily závodu

source: Edit event link
cs: Upravit odkaz na závod

source: Edit link details
cs: Upravit detaily odkazu

source: Edit runner details
cs: Upravit detaily běžce

source: Edit user details
cs: Upravit detaily uživatele

source: Email
cs: Emailová adresa

source: Email address
cs: Emailová adresa

source: Enter ORIS event ID (list of recent events loading or unavailable)
cs: Zadej ORISové ID závodu (seznam posledních závodů se načítá nebo je nedostupný)

source: Enter ORIS event ID or select from your recent events
cs: Zadej ORISové ID závodu nebo vyberte ze seznamu

source: Enter current password
cs: Zadej aktuální heslo

source: Enter email address
cs: Zadej emailovou adresu

source: Enter new password
cs: Zadej nové heslo

source: Enter password
cs: Zadej heslo

source: Enter user name (your email address will be used if left blank)
cs: Zadej uživatelské jméno (výchozí uživatelské jméno je tvoje emailová adresa)

source: Error (get user): {userErrorMessage}
cs: Chyba (uživatelní): {userErrorMessage}

source: Error: Incorrect file type. Please check and try again.
cs: Chyba: Špatný typ souboru. Prosím, zkontroluj a zkus to znovu.

source: Error: {errorMessage}
cs: Chyba: {errorMessage}

source: Error: {errorMessage} Please try again.
cs: Chyba: {errorMessage} Prosím, zopakuj

source: Event List
cs: Seznam závodů

source: Event details
cs: Detaily závodu

source: Event link details not found
cs: Detailní Odkaz závodu nenalezen

source: Event location (latitude)
cs: Místo (zeměpisná šířka)

source: Event location (longitude)
cs: Místo (zeměpisná délka)

source: Event tags
cs: Označení závodu

source: Event website
cs: Webová stránka závodu

source: Events
cs: Závody

source: Events connected by this link
cs: Závody spojené tímto odkazem

source: Events included
cs: Obsažené závody

source: Field size
cs: Počet běžců

source: Filter by tag
cs: Filtrovat podle označení

source: Filter table
cs: Filtrovat položky tabulky

source: Full name
cs: Celé jméno

source: Full name of club
cs: Celé jméno oddílu

source: Full name of user
cs: Celé jméno uživatele

source: Groups of other events that this event is linked to
cs: Skupiny ostatních závodů spojených s tímto závodem

source: Hide event link list
cs: Schovat seznam odkazů na závody

source: How to use MapOholic
cs: Jak používat MapOholic

source: I developed MapOholic for two reasons:
cs: Vyvinul jsem MapOholic ze dvou důvodů:

source: Internal ID: {userId}
cs: Interní ID: {userId}

source: It is a tool that I have often wished that I could have. Over 25 years' worth of maps fills eight large ring binders and while it's a nice collection it is not always easy to find a map from a particular event, or of a particular area. These days details and results are all online, and routes are more commonly captured by a GPS tracker than drawn on the map. While I've developed MapOholic to meet my own particular requirements and priorities, I hope others may find it useful too.
cs: Je to nástroj, který jsem si často přál. Má sbírka map za posledních 25+ let naplňuje osm velkých šanonů a i když je moc pěkná, tak není vždycky lehké v ní najít mapu z určitého závodu nebo z určité oblasti. Nyní jsou informace a výsledky na internetu a postupy se častěji zapisují pomocí GPS přístroje než ručně na mapu. Přestože jsem při tvorbě MapOholicu bral v potaz hlavně své vlastní požadavky a priority, tak doufám, že se nástroj bude hodit i ostatním.

source: It is also a practical demonstration of my full stack web development skills and I have produced it to both improve and showcase those skills through developing a solution to a real requirement. For the technically minded, the front end is based on {linkReact} and {linkRedux}, the back end on {linkNode} and {linkExpress} with all the data (other than the image files) stored in {linkMongo}. Both are open source (ISC) and can be found on Github ({linkGithubClient}/{linkGithubServer}) if you are interested.
cs: Je také praktickou ukázkou celé škály mých dovedností v oboru vývoje webových stránek a MapOholic jsem vytvořil, abych skrze řešení reálného požadavku tyto dovednosti mohl předvést a přitom je vylepšil. Front end je založen na {linkReact} a na {linkRedux}, back end je založen na {linkNode} a na {linkExpress} a všechna data (kromě obrázků) jsou uložena v {linkMongo}. Obojí je v rámci open source (ISC), dostupné na Githubu ({linkGithubClient}/{linkGithubServer}) jestli máš zájem.

source: It links the following events:
cs: Odkaz spojuje tyto závody:

source: It's now time to add some maps! Click the big "Add or Delete maps" button at the top, which enables you to upload both a course map and a route map (i.e. the same map with the route drawn on). You can also give the map a title, which will be shown if you add a different map for the same event later, for example if the course was in two parts. For the course map, you are given the option to add a border. This makes it easier to work with QuickRoute, which outputs images bigger than the original when you have added a route; without the border switching between course and route would not be smooth. If you do not have a route to upload, or you drew it on the course map with a different tool, you can ignore this option.
cs: Teď přišel čas přidat mapy! Klikni na velké tlačítko "Přidat nebo Smazat mapy", které ti umožňuje nahrát mapu trati i mapu s postupy (tj. jedna mapa, která má na sobě nakreslenou i postupy). Můžeš mapu také pojmenovat, nadpis bude viditelný pokud přidáš i další mapu ze stejného závodu, například pokud byla trať rozdělena na dvě části. Po přidání mapy s tratí máš možnost mapu ohraničit. Tato možnost zjednodušuje práci s QuickRoute, který po přidání trasy vytváří obrázky větší než je originál; bez ohraničení by přepínání mezi tratí a trasou nefungovalo tak hladce. Pokud nemáš trasu k nahrání nebo je nakreslena na mapu jiným programem, tak můžeš tuto možnost ignorovat.

source: Joined: {0}
cs: Uživatelem od: {0}

source: Last updated: {0}
cs: Naposledy aktualizováno: {0}

source: Length of course (km)
cs: Délka trati (km)

source: Link to event results
cs: Webová adresa výsledků

source: Linked events: {displayName}
cs: Propojené závody: {displayName}

source: Linked to
cs: Propojené s

source: Loading club details...
cs: Načítám detaily oddílu...

source: Loading event details...
cs: Načítám detaily závodu...

source: Loading recent activity...
cs: Načítám poslední aktivitu...

source: Loading user details...
cs: Načítám detaily uživatele...

source: Location
cs: Místo

source: Location (country)
cs: Místo (země)

source: Location of event (e.g. nearest town)
cs: Místo konání

source: Location of event (latitude/longitude)
cs: Místo závodu (zeměpisná šířka/délka)

source: Locations of map corners (four latitude/longitude pairs)
cs: Rohy mapy (čtyřkrát zeměpisná šířka/délka)

source: Log In
cs: Přihlásit se

source: Log Out
cs: Odhlásit se

source: Log in
cs: Přihlásit se

source: Log in to MapOholic
cs: Přihlásit se na MapOholic

source: Logged out
cs: Odhlášen

source: Manage linked events
cs: Spravovat propojené závody

source: Map
cs: Mapa

source: Map Viewer
cs: Prohlížeč map

source: Map name
cs: Název mapy

source: Map title
cs: Nadpis mapy

source: MapOholic has been, and is still being, developed by {linkMark}. I am a British orienteer living in Prague and a member of {linkDKP} and {linkDRONGO}, hence the integration with {linkORIS} * and the whole site being translated into Czech. (There are no technical reasons why it can't support other languages that I don't speak, if anyone out there would like to use a different language and is willing to do the translations!)
cs: MapOholic vytvořil a nadále vylepšuje {linkMark}. Jsem britský orientační běžec žijící v Praze, člen {linkDKP} a {linkDRONGO}, proto vzniklo propojení s ORISem a proto je celý portál přeložen do čestiny. (Není žadný důvod proč by neměl fungovat i v dalších jazycích pokud by se našel někdo, kdo by stránky přeložil!)

source: Member of
cs: Člen

source: Members
cs: Členové

source: My Maps
cs: Moje mapy

source: NE
cs: SV

source: NW
cs: SZ

source: Name
cs: Název

source: Name of event (required)
cs: Název závodu (povinné pole)

source: Name of event link (required)
cs: Název odkazu na závod (povinné pole)

source: Name of map used for event
cs: Název mapy použité pro závod

source: National registration number of user
cs: Registrační číslo

source: New password
cs: Nové heslo

source: No comments have been posted yet
cs: Ještě nebyly přijaty žádné komentáře

source: No course details to display
cs: Detaily trati nejsou dostupné

source: No result to display
cs: Výsledek není dostupný

source: Note: Deletion is only permitted by standard users if there are no runners at the event, or you are the only runner. Deleting an event also removes all references to it in linked events.
cs: Poznámka: Závod může běžný uživatel vymazat pouze v případě, že neobsahuje žádné běžce nebo je on sám jediným běžcem. Vymazáním závodu se vymažou také všechny odkazy na něj v rámci propojených závodů.

source: Note: The overlays will only be perfectly aligned if they were drawn on the same course map.
cs: Poznámka: Zakreslené trasy (“overlays”) budou zarovnáne pouze v případě, že mapa na kterou byly zakresleny, je úplně stejná.

source: Number of controls
cs: Počet kontrol

source: Number of controls on course
cs: Počet kontrol na trati

source: Once you have created the event, or are looking at its details if it already exists, add yourself as a runner (below the details in list view, to the right of the details in map view). This will take you to the Current Map screen with this event selected. Again, there is a bonus if the event and your entry are in ORIS, because course details and results can be populated automatically too. Edit runner details allows you to enter course details manually, as well as to add personal tags to help you search your collection later and to decide who else can see your maps for this particular event (just you, anyone who is a member of the same club as you, all registered users of the site, or anyone anywhere in the entire world).
cs: Poté co vytvoříš záznam závodu nebo pokud si prohlížíš detaily závodu, který již někdo vytvořil, tak se přidej jako běžce (pod detaily v seznamovém náhledu, vpravo od detailů v mapovém náhledu). To tě přivede na stránku Aktuální mapy tohoto závodu. Pokud jsou závod a tvoje přihláška na něj v ORISu, tak mohou být detaily trati a výsledky staženy automaticky. “Upravit detaily běžce” ti umožní zadat detaily trati ručně, navíc si zde můžeš přidat libovolné označení, které ti zjednoduší pozdější vyhledávání, a určit kdo si může tvé mapy z tohoto závodu prohlédnout (jen ty, členové tvého oddílu, všichni registrovaní uživatelé MapOholicu nebo kdokoli kdekoli na světě).

source: Organised by
cs: Pořadatel

source: Owner
cs: Vlastník

source: Owner of club record in this database
cs: Vlastník záznamu o oddílu v této databázi

source: Owner of event record in this database
cs: Vlastník záznamu o závodě v této databázi

source: Owner: {0}
cs: Vlastník: {0}

source: Page
cs: Strana

source: Password
cs: Heslo

source: Personal tags
cs: Vlastní označení

source: Personal tags for event
cs: Vlastní označení pro tento závod

source: Place
cs: Místo

source: Placing in field
cs: Umístění

source: Please {signUpLink} or {logInLink} to use all the exciting features of this site. If you would like to see more before you sign up, some of the maps are visible to unregistered visitors too, you can search for them {eventsListLink} or {eventsMapLink}.
cs: Prosím {signUpLink}registruj se nebo {logInLink}se přihlaš k plnému využití všech vychytávek této webové stránky. Pokud se chceš dozvědět více ještě než se zaregistruješ, některé mapy jsou viditelné i pro nezaregistrované uživatele, vyhledávat v nich můžeš přes {eventsListLink} nebo {eventsMapLink}.

source: Post comment
cs: Přidat komentář

source: Profile visibility
cs: Viditelnost profilu

source: Profile visibility: {visibility}
cs: Viditelnost profilu: {visibility}

source: Recent activity
cs: Nedávné změny

source: Refresh list
cs: Obnovit seznam

source: Region(s) (customisable)
cs: Regiony

source: Region(s) associated with event
cs: Regiony spojené se závodem

source: Registration number
cs: Registrační číslo

source: Result: <0>{time}</0>
cs: Výsledek: <0>{time}</0>

source: Results
cs: Výsledky

source: Return to map view
cs: Návrat do mapového náhledu

source: Route
cs: Postup

source: Runner details
cs: Detaily běžce

source: Runners at event (select one to see their maps)
cs: Běžci na závodě (vyber jednoho abyste zobrazili jeho mapy)

source: SE
cs: JV

source: SW
cs: JZ

source: Save Results
cs: Uložit Výsledky

source: Save changes
cs: Uložit změny

source: Search for events
cs: Hledat závody

source: Search for the event you ran at: if it's there, great; if not you can add it. If it happens to be a Czech event on ORIS, you're lucky and can import all the event information automatically, just select it from the list of recent events at the top. Otherwise you can enter as much information about the event as you like, only the date and its name are required.
cs: Vyhledej závod, ve kterém jsi běžel: pokud se najde, skvělé, pokud ne, tak ho můžeš přidat. Pokud je to český závod na ORISu, máš štěstí a můžeš všechny informace stáhnout automaticky, stačí si závod vybrat ze seznamu nedávných závodů nahoře. V opačném případě můžeš vyplnit tolik informací o závodě kolik chceš, pouze datum a název závodu jsou povinná pole.

source: See below for detailed results ({0} runners)
cs: Viz níže pro podrobné výsledky ({0} běžců)

source: Select a club from the list to show further details here
cs: Pro více informaci, vyberte zde oddíl ze seznamu

source: Select a runner from the list to show further details here
cs: Pro více informaci, vyberte zde běžce ze seznamu

source: Select a user from the list to show further details here
cs: Pro více informaci, vyberte zde uživatele ze seznamu

source: Select your JSON or CSV results file (drag and drop or click to open file dialogue).
cs: Vyber soubor s výsledyů ve formátu CSV nebo JSON (přetažením nebo kliknutím, což otevře dialog pro otevření souboru).

source: Select your course map file (drag and drop or click to open file dialogue). The file must be a JPEG or PNG image, maximum size 5MB.
cs: Vyber soubor mapy trati (přetažením nebo kliknutím, což otevře dialog pro otevření souboru). Soubor musí být typu JPEG nebo PNG, maximální velikost 5MB.

source: Select your file (drag and drop or click to open file dialogue). The file must be a JPEG or PNG image, maximum size 1MB.
cs: Vyber soubor (přetažením nebo kliknutím, což otevře dialog pro otevření souboru). Soubor musí být obrázkek typu JPEG nebo PNG, maximální velikost 1MB.
