Repository: markcollis/mapoholic-client
Catalog: src/locales/*/messages.po
Languages: cs

source: Select your route map file (drag and drop or click to open file dialogue). The file must be a JPEG or PNG image, maximum size 5MB.
cs: Vyber soubor mapy postupů (přetažením nebo kliknutím, což otevře dialog pro otevření souboru). Soubor musí být obrázekek typu JPEG nebo PNG, maximální velikost 5MB.

source: Show and edit map corner locations
cs: Nastav a edituj pozici rohů mapy

source: Show event link list
cs: Zobrazit seznam odkazů na závody

source: Show routes as highlighted overlays:
cs: Zobrazit zvýrazněně postupy

source: Sign Up
cs: Zaregistrovat se

source: Sign up
cs: Zaregistrovat se

source: Sign up for MapOholic
cs: Zaregistrovat se na MapOholic

source: Site activity history
cs: Dějiny aktivit

source: So, you've created an account and logged in for the first time. What do you do next? I'll assume that you already have some scanned maps ready to upload.
cs: Takže účet je vytvořen a poprvé jsi se přihlásil(a). Co teď? Předpokládám, že už máš nějaké naskenované mapy připravené k nahrání.

source: Sorry to see you leave, come back again soon!
cs: Je nám líto, že nás opouštíš, vrať se brzy!

source: Sorry, no event is selected.
cs: Je nám líto, ale není vybraný žádný závod.

source: Sorry, no event links found.
cs: Je nám líto, ale nebyly nalezeny žádné odkazy na závody.

source: Sorry, no matching runner details were found.
cs: Je nám líto, ale žádný běžec s těmito detaily nebyl nalezen.

source: Sorry, something has gone very wrong and MapOholic is not currently available.
cs: Je nám líto, ale něco je rozbité a MapOholic teď nefunguje.

source: Sorry, something has gone wrong with this part of MapOholic{0}. Please try again in case it is a temporary problem. Other functionality should not be affected.
cs: Je nám líto, ale něco je rozbité{0}.

source: Sorry, there are no maps to display.
cs: Je nám líto, ale žádná taková mapa nebyla nalezena.

source: Sorry, there aren't any matching clubs to display!
cs: Je nám líto, ale žádný takový oddíl nebyl nalezen!

source: Sorry, there aren't any matching events to display!
cs: Je nám líto, ale žádný takový závod nebyl nalezen!

source: Sorry, there aren't any matching users to display!
cs: Je nám líto, ale žádný uživatel nebyl nalezen!

source: Standard abbreviation for club
cs: Standardní zkratka oddílu

source: Tags (customisable)
cs: Označení (přizpůsobitelné)

source: Tags for event
cs: Označení pro závod

source: That's it for this event, now upload some more maps for another event, browse other users' maps for this event or search through the archive for any other maps of interest.
cs: Tak to je pro tento závod hotové, teď můžes nahrát mapy z jiného závodu, prohlížet mapy jiných uživatelů z tohoto závodu nebo prohledávat archiv map, které by tě mohly zajímat.”

source: The club {0} was deleted by {1}
cs: Oddíl {0} byl smazán uživatelem {1}

source: The club {0} was updated by {1}
cs: Oddíl {0} byl aktualizován uživatelem {1}

source: The core functionality of MapOholic is to provide an online home for scanned images of your orienteering maps, together with your routes if you have them (whether drawn manually, or captured with a GPS watch/tracker and drawn in <0>QuickRoute</0>*). You can zoom in and rotate maps and switch easily between the plain course and your route. More than one map can be uploaded for an event, to allow for multi-part courses.
cs: Hlavní funkce MapOholicu je jako online archiv naskenovaných orientačních map, spolu s tvými postupy pokud je máš (nakreslené ručně nebo pomocí GPS hodinek/trackeru a zakreslené za použití <0>QuickRoute</0>*). Mapy můžeš libovolně zvětšovat, otáčet a jednoduše přepínat mezi mapou s tratí a tvými postupy. Pro jeden závod může být nahráno více map, například pokud měla trať víc částí nebo pokud jsi běžel více tratí na jednom závodě nebo tréninku.

source: The event {0} was deleted by {1}
cs: Závod {0} byl smazán uživatelem {1}

source: The event {0} was updated by {1}
cs: Závod {0} byl aktualizován uživatelem {1}

source: The link between events {0} was deleted by {1}
cs: Propojení mezi závody {0} bylo smazáno uživatelem {1}

source: The link between events {0} was updated by {1}
cs: Proppojení mezi závody {0} bylo aktualizováno uživatelem {1}

source: The new club {0} was created by {1}
cs: Nový oddíl {0} byl vytvořen uživatelem {1}

source: The new event {0} was created by {1}
cs: Nový závod {0} byl vytvořen uživatelem {1}

source: The user {0} was deleted by {1}
cs: Uživatel {0} byl smazán uživatelem {1}

source: The user {0} was updated by {1}
cs: Uživatel {0} byl aktualizován uživatelem {1}

source: Then MapOholic might be for you!
cs: To by se MapOholic mohl hodit i Tobě!

source: There has been no recent activity.
cs: Nebyla žádná nedávná aktivita.

source: This will delete all records relating to this club, including connections with users (as members) and events (as organisers).
cs: Tímto se vymažou všechny detaily spojené s tímto oddílem, včetně propojení s uživately (členi) a se závody (pořadatelé)

source: Time
cs: Čas

source: Time behind the winner
cs: Ztráta na vítěze

source: Time behind winner
cs: Ztráta na vítěze

source: Time taken
cs: Čas

source: Title for map (e.g. "Part 1")
cs: Název mapy (např. "1. Část")

source: Title of course
cs: Název trati

source: To amend results, you need to download them (in either CSV or JSON format), make whatever changes you want using a text editor or spreadsheet*, then re-upload them to replace the existing results. (*LibreOffice or Google Sheets provide better support for CSV import and export than MS Excel)
cs: K editaci výsledků je třeba je stáhnout (ve formátu CSV nebo JSON), změnit pomocí textového nebo tabulkového editoru* a poté znovu nahrát a vyměnit existující soubor s výsledky. (*LibreOffice nebo GoogleSheets jsou lépe vybaveny k importu/exportu CSV souborů než MS Excel).

source: Total number of runners
cs: Počet běžců

source: Type of event
cs: Disciplína

source: Type(s) of event
cs: Disciplíny

source: Unknown actionType {actionType}
cs: Neznámý actionType {actionType}

source: Update
cs: Aktualizovat

source: Upload selected
cs: Nahrát vyběr

source: User list
cs: Seznam Uživatelů

source: User name
cs: Jméno uživatele

source: User profile
cs: Profil uživatele

source: User search filter
cs: Filtr pro hledání uživatele

source: User type: {role}
cs: Druh užvatele: {role}

source: Users
cs: Uživatelé

source: Visibility
cs: Viditelnost

source: Visibility of your maps from this event to others
cs: Viditelnost tvých map z tohoto závodu ostatním

source: Website
cs: Webová stránka

source: Welcome to MapOholic!
cs: Vítéj na MapOholic!

source: What is it?
cs: Co to je?

source: Where user is based
cs: Kde uživatel bydlí

source: You are about to delete {runnerName} from {name} ({0}).
cs: Chystáš se smazat {runnerName} z {name} ({0}).

source: You are currently logged in.
cs: Jsi přihlášen.

source: You can upload full results for your course/class in either CSV format (exported from a spreadsheet) or JSON format if you are producing them programatically. If you download one of the following templates you will see what fields are required.
cs: Zde můžeš nahrát výsledky své kategorie v CSV (exportované z tabulky) nebo JSON formátu. Z templátů stáhnutelných níže je vidět, jaká pole je třeba vyplnit.

source: You have already uploaded {uploadedMapsText} from {attendedEventsText}. You can browse or search for them either {myEventsListLink} or {myEventsMapLink}.
cs: Už jsi nahrál(a) {uploadedMapsText} ze závodu {attendedEventsText}. Můžeš je prohlížet a hledat přes náhled přes seznam {myEventsListLink} nebo náhled přes mapu {myEventsMapLink}.

source: You have not added any events yet.
cs: Dosud jsi nepřidal(a) žadné závody.

source: You have not yet uploaded any maps. Why not start now?
cs: Dosud jsi nepřidal(a) žadné mapy. Proč nezačít hned teď?

source: Your own password
cs: Vaše vlastní heslo

source: Your own recent activity
cs: Tvoje vlastní nedávná aktivita

source: [unknown course]
cs: [neznámá trať]

source: by name
cs: jménem

source: client
cs: klienta

source: log in
cs: přihlasit se

source: no map yet
cs: ještě není mapa

source: no maps found
cs: žádné mapy nenalezeny

source: none
cs: nikdo

source: of {fieldSize}
cs: z {fieldSize}

source: of {totalPages}
cs: z {totalPages}

source: on a map
cs: na mapě

source: orienteering maps...
cs: mapy OB...

source: rows per page
cs: řádky na stránce

source: sign up
cs: zaregistrovat se

source: themselves
cs: pro sebe

source: untitled
cs: bez titulu

source: {0, plural, one {# comment} other {# comments}}
cs: {0, plural, one {# komentář} few {# komentáře} many {# komentáře} other {# komentářů}}

source: {0, plural, one {# map} other {# maps}}
cs: {0, plural, one {# mapa} few {# mapy} many {# mapy} other {# map}}

source: {0} created an account
cs: {0} vytvořil(a) účet

source: {0} deleted a map from {1}
cs: {0} smazal(a) mapu z {1}

source: {0} ran at {1}
cs: {0} běžel(a) na {1}

source: {0} uploaded a map from {1}
cs: {0} nahrál(a) mapu z {1}

source: {0}'s details for {1} were updated by {2}
cs: Detaily běžce {0} na {1} byly aktualizovány uživatelem {2}

source: {0}'s record for {1} was deleted by {2}
cs: Záznam běžce {0} na {1} byl smazán uživatelem {2}

source: {attendedEvents, plural, one {# event} other {# events}}
cs: {attendedEvents, plural, one {# závod} few {# závody} many {# závodu} other {# závodů}}

source: {courseControls} controls
cs: {courseControls} kontrol

source: {eventCount, plural, one {# event} other {# events}}
cs: {eventCount, plural, one {# závod} few {# závody} many {# závodu} other {# závodů}}

source: {uploadedMaps, plural, one {# map} other {# maps}}
cs: {uploadedMaps, plural, one {# mapa} few {# mapy} many {# mapy} other {# map}}
